Revit 2027 API
FamilyElementVisibility.IsShownInCoarse Property
Indicates if the instance is display with Coarse detail level in the view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShownInCoarse { get; set; }
Public Property IsShownInCoarse As Boolean
	Get
	Set
public:
property bool IsShownInCoarse {
	bool get ();
	void set (bool value);
}
member IsShownInCoarse : bool with get, set
Property Value
Boolean
Remarks
This property cannot be set to false if the other two detail levels are also false.
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace